openxc/vi-firmware/src/libs/CDL/LPC177x_8xLib/src/lpc177x_8x_mci.c
	// Transfer size
	GPDMACfg.TransferSize = DMA_MCI_SIZE;
	// Transfer width
	GPDMACfg.TransferWidth = GPDMA_WIDTH_WORD;
	// Transfer type
	GPDMACfg.TransferType = DMAMode;
	// Linker List Item - unused
	GPDMACfg.DMALLI = 0;
	
	/* USB RAM is used for test.
	Please note, Ethernet has its own SRAM, but GPDMA can't access
	that. GPDMA can access USB SRAM and IRAM. Ethernet DMA controller can 
	access both IRAM and Ethernet SRAM. */
	GPDMACfg.ChannelNum = ChannelNum;
	
	if ( DMAMode == GPDMA_TRANSFERTYPE_M2P_DEST_CTRL )
	{
		/* Ch0 set for M2P transfer from mempry to MCI FIFO. */
		// Source memory
		GPDMACfg.SrcMemAddr = (uint32_t)memBuf;
		// Destination memory
		GPDMACfg.DstMemAddr = (uint32_t)LPC_MCI->FIFO;

		// Source connection 
		GPDMACfg.SrcConn = 0;
		// Destination connection 
		GPDMACfg.DstConn = GPDMA_CONN_MCI;
			
	}
	else if ( DMAMode == GPDMA_TRANSFERTYPE_P2M_SRC_CTRL )
	{
		/* Ch0 set for P2M transfer from MCI FIFO to memory. */
		// Source memory
		GPDMACfg.SrcMemAddr = (uint32_t)LPC_MCI->FIFO;
		// Destination memory
		GPDMACfg.DstMemAddr = (uint32_t)memBuf;

		// Source connection 
		GPDMACfg.SrcConn = GPDMA_CONN_MCI;
		// Destination connection
		GPDMACfg.DstConn = 0;
	}
	else
	{
		return ( FALSE );
	}

	// Setup channel with given parameter
	GPDMA_Setup(&GPDMACfg);

	// Enable GPDMA channel 
	GPDMA_ChannelCmd(ChannelNum, ENABLE);

	/* Enable GPDMA interrupt */
	NVIC_EnableIRQ(DMA_IRQn);
	
	return (TRUE);
}


/*********************************************************************//**
 * @brief		GPDMA interrupt handler sub-routine
 *
 * @param		None
 *
 * @return 		None
 *
 * @note		This is only executed if DMA support is enabled
 **********************************************************************/
void MCI_DMA_IRQHandler (void)
{
	// check GPDMA interrupt on channel 0
	if (GPDMA_IntGetStatus(GPDMA_STAT_INT, MCI_DMA_WRITE_CHANNEL))
	{
		//check interrupt status on channel 0
		// Check counter terminal status
		if(GPDMA_IntGetStatus(GPDMA_STAT_INTTC, MCI_DMA_WRITE_CHANNEL))
		{
			// Clear terminate counter Interrupt pending
			GPDMA_ClearIntPending (GPDMA_STATCLR_INTTC, MCI_DMA_WRITE_CHANNEL);

			dmaWrCh_TermianalCnt++;
		}
		if (GPDMA_IntGetStatus(GPDMA_STAT_INTERR, MCI_DMA_WRITE_CHANNEL))
		{
			// Clear error counter Interrupt pending
			GPDMA_ClearIntPending (GPDMA_STATCLR_INTERR, MCI_DMA_WRITE_CHANNEL);

			dmaWrCh_ErrorCnt++;
		}
	}
	else if (GPDMA_IntGetStatus(GPDMA_STAT_INT, MCI_DMA_READ_CHANNEL))
	{
		//check interrupt status on channel 0
		// Check counter terminal status
		if(GPDMA_IntGetStatus(GPDMA_STAT_INTTC, MCI_DMA_READ_CHANNEL))
		{
			// Clear terminate counter Interrupt pending
			GPDMA_ClearIntPending (GPDMA_STATCLR_INTTC, MCI_DMA_READ_CHANNEL);

			dmaRdCh_TermianalCnt++;
		}
		if (GPDMA_IntGetStatus(GPDMA_STAT_INTERR, MCI_DMA_READ_CHANNEL))
		{
			// Clear error counter Interrupt pending
			GPDMA_ClearIntPending (GPDMA_STATCLR_INTERR, MCI_DMA_READ_CHANNEL);

			dmaRdCh_ErrorCnt++;
		}
	}
}
#endif


/*********************************************************************//**
 * @brief 		Read data from FIFO (after a transmission with card) to
 *				a destination buffer
 *
 * @param[in]	*dest The buffer to store the data that read from card
 *
 * @return 		MCI_FUNC_OK
 *************************************************************************/
int32_t MCI_ReadFifo(uint32_t * dest) 
{
	uint8_t i;
    uint8_t start, end;

    if(fifo_plane == 0)
    {
        start = 0;
        end = 7;
    }
    else
    {
        start = 8;
        end = 15;
    }
    fifo_plane = (fifo_plane) ? 0:1;

	for (i = start; i <= end; i++) 
	{
		*dest = LPC_MCI->FIFO[i];
		
		dest++;
	}
	
	return MCI_FUNC_OK;
}


/*********************************************************************//**
 * @brief 		Write data from a source buffer to FIFO for transmission
 *
 * @param[in]	*src The buffer hold the data need to write to card
 *
 * @return 		MCI_FUNC_OK
 *************************************************************************/
int32_t MCI_WriteFifo(uint32_t * src)
{
	uint8_t i;
    uint8_t start, end;

    if(fifo_plane == 0)
    {
        start = 0;
        end = 7;
    }
    else
    {
        start = 8;
        end = 15;
    }
    fifo_plane = (fifo_plane) ? 0:1;

	for (i = start; i <= end; i++) 
	{
		LPC_MCI->FIFO[i] = *src;
		
		src++;
	}
	
	return MCI_FUNC_OK;
}


/*********************************************************************//**
 * @brief 		Enable Transmit data interrupt
 *
 * @param		None
 *
 * @return 		None
 *************************************************************************/
void MCI_TXEnable( void )
{
#if MCI_DMA_ENABLED
	LPC_MCI->MASK0 |= ((DATA_END_INT_MASK)|(ERR_TX_INT_MASK));	/* Enable TX interrupts only */
#else
	LPC_MCI->MASK0 |= ((FIFO_TX_INT_MASK)|(DATA_END_INT_MASK)|(ERR_TX_INT_MASK));	/* FIFO TX interrupts only */
#endif

	return;
}


/*********************************************************************//**
 * @brief 		Disable Transmit data interrupt
 *
 * @param		None
 *
 * @return 		None
 *************************************************************************/
void MCI_TXDisable( void )
{
#if MCI_DMA_ENABLED
	LPC_MCI->MASK0 &= ~((DATA_END_INT_MASK)|(ERR_TX_INT_MASK));	/* Enable TX interrupts only */
#else
	LPC_MCI->MASK0 &= ~((FIFO_TX_INT_MASK)|(DATA_END_INT_MASK)|(ERR_TX_INT_MASK));	/* FIFO TX interrupts only */
#endif

	return;
}


/*********************************************************************//**
 * @brief 		Enable Receive data interrupt
 *
 * @param		None
 *
 * @return 		None
 *************************************************************************/
void MCI_RXEnable( void )
{
#if MCI_DMA_ENABLED
	LPC_MCI->MASK0 |= ((DATA_END_INT_MASK)|(ERR_RX_INT_MASK));	/* Enable RX interrupts only */
#else
	LPC_MCI->MASK0 |= ((FIFO_RX_INT_MASK)|(DATA_END_INT_MASK)|(ERR_RX_INT_MASK));	/* FIFO RX interrupts only */
#endif

	return;
}


/*********************************************************************//**
 * @brief 		Disable Receive data interrupt
 *
 * @param		None
 *
 * @return 		None
 *************************************************************************/
void MCI_RXDisable( void )
{
#if MCI_DMA_ENABLED
	LPC_MCI->MASK0 &= ~((DATA_END_INT_MASK)|(ERR_RX_INT_MASK));	/* Enable TX interrupts only */
#else
	LPC_MCI->MASK0 &= ~((FIFO_RX_INT_MASK)|(DATA_END_INT_MASK)|(ERR_RX_INT_MASK));	/* FIFO TX interrupts only */
#endif

	return;
}


/*********************************************************************//**
 * @brief 		Check status when working with data-block transfer
 *
 * @details		Right after the block read and write, this routine is important
 *				that, even the FIFO is empty, complete block has been sent, but,
 *				data is still being written to the card. This routine is to 
 *				ensure that the data has been written based on the state of 
 *				the card, not by the length being set.
 *
 * @param		None
 *
 * @return 		MCI_FUNC_OK if all success
 *************************************************************************/
int32_t MCI_CheckStatus(void)
{
	int32_t respValue, retval = MCI_FUNC_FAILED;

	while (1)
	{
		if (MCI_GetCardStatus(&respValue) != MCI_FUNC_OK)
		{
			break;
		}
		else
		{
			/* The only valid state is TRANS per MMC and SD state diagram.
			RCV state may be seen, but, it happens only when TX_ACTIVE or
			RX_ACTIVE occurs before the WRITE_BLOCK and READ_BLOCK cmds are
			being sent, which is not a valid sequence. */
			if(!(respValue & _SHIFT(MCI_CARDSTATUS_READYFORDATA_P0S)))
			{
				retval = MCI_FUNC_NOT_READY;
			}
			else if(CARDSTATEOF(respValue) != MCI_CARDSTATE_TRAN)
			{
				/* Should be in STANDBY state now and ready */
				retval = MCI_FUNC_ERR_STATE;
			}
			else
			{
				return MCI_FUNC_OK;
			}
		}
	}

	return retval;
}


/*********************************************************************//**
 * @brief 		Called by MCI interrupt handler to simplify the command
 *				process.
 *
 * @param		None
 *
 * @return 		None
 *
 * @note		In card initialization, the commnad interrupts are disabled
 *************************************************************************/
void MCI_CmdProcess( void )
{
	uint32_t MCIStatus;

	MCIStatus = LPC_MCI->STATUS;

	if ( MCIStatus &  MCI_CMD_CRC_FAIL )
	{
		LPC_MCI->CLEAR =  MCI_CMD_CRC_FAIL;
	}

	if ( MCIStatus &  MCI_CMD_TIMEOUT )
	{
		LPC_MCI->CLEAR =  MCI_CMD_TIMEOUT;
	}

	/* Cmd Resp End or Cmd Sent */
	if ( MCIStatus &  MCI_CMD_RESP_END )
	{
		LPC_MCI->CLEAR =  MCI_CMD_RESP_END;
	}

	if ( MCIStatus &  MCI_CMD_SENT )
	{
		LPC_MCI->CLEAR =  MCI_CMD_SENT;
	}

	if ( MCIStatus &  MCI_CMD_ACTIVE )
	{
		LPC_MCI->CLEAR =  MCI_CMD_ACTIVE;
	}

	return;
}


/*********************************************************************//**
 * @brief 		Called by MCI interrupt handler to manage error on the bus
 *
 * @param		None
 *
 * @return 		None
 *************************************************************************/
void MCI_DataErrorProcess( void )
{
	uint32_t MCIStatus;

	MCIStatus = LPC_MCI->STATUS;

	if ( MCIStatus &  MCI_DATA_CRC_FAIL )
	{
		LPC_MCI->CLEAR = MCI_DATA_CRC_FAIL;
	}

	if ( MCIStatus &  MCI_DATA_TIMEOUT )
	{
		LPC_MCI->CLEAR =  MCI_DATA_TIMEOUT;
	}

