openxc/vi-firmware/src/libs/CDL/LPC177x_8xLib/src/lpc177x_8x_mci.c
	MCI_CardType = MCI_CARD_UNKNOWN;

	// Following block of code added to ensure card VCC drops to zero
    // before card is initialized
  
   // Force all MCI control pins to basic I/O mode
   LPC_IOCON->P1_2  &= ~0x1F; /* SD_CLK @ P1.2 */
   LPC_IOCON->P1_3  &= ~0x1F; /* SD_CMD @ P1.3 */
   LPC_IOCON->P1_5  &= ~0x1F; /* SD_PWR @ P1.5 */
   LPC_IOCON->P1_6  &= ~0x1F; /* SD_DAT_0 @ P1.6 */
   LPC_IOCON->P1_7  &= ~0x1F; /* SD_DAT_1 @ P1.7 */
   LPC_IOCON->P1_11 &= ~0x1F; /* SD_DAT_2 @ P1.11 */
   LPC_IOCON->P1_12 &= 0x1F; /* SD_DAT_3 @ P1.12 */

   // Set all MCI pins to outputs
   LPC_GPIO1->DIR |= 0x18EC;
  
   // Force all pins low (except power control pin)
   LPC_GPIO1->CLR = 0x1000;
   LPC_GPIO1->CLR = 0x0800;
   LPC_GPIO1->CLR = 0x0080;
   LPC_GPIO1->CLR = 0x0040;
  
   LPC_GPIO1->SET = 0x0020;
  
   LPC_GPIO1->CLR = 0x0008;
   LPC_GPIO1->CLR = 0x0004;

   // Crude delay of 50ms at 120MHz
   for ( i = 0; i < 0x100000; i++ );

	LPC_SC->PCONP |= ( 1 << 28 );			/* Enable clock to the MCI block */

	if ( LPC_MCI->CLOCK & (1 << 8) )
	{
		LPC_MCI->CLOCK &= ~(1 << 8);
	}

	if ( LPC_MCI->POWER & 0x02 )
	{
		LPC_MCI->POWER = 0x00;
	}

	for ( i = 0; i < 0x1000; i++ );

	/* Disable all interrupts for now */
	LPC_MCI->MASK0 = 0;

	//SD_CLK
	PINSEL_ConfigPin(1, 2, 2);

	//SD_CMD
	PINSEL_ConfigPin(1, 3, 2);

	//SD_PWR
	PINSEL_ConfigPin(1, 5, 2);

	//SD_DAT_0
	PINSEL_ConfigPin(1, 6, 2);

	//SD_DAT_1
	PINSEL_ConfigPin(1, 7, 2);

	//SD_DAT_2
	PINSEL_ConfigPin(1, 11, 2);

	//SD_DAT_3
	PINSEL_ConfigPin(1, 12, 2);

	// SD_PWR is active high (follows the output of the SD Card interface block).
	if(powerActiveLevel == LOW_LVL)
	{
		LPC_SC->SCS &= ~ 0x08;//Becase on EA board SD_PWR is active low
	}
	else
	{
		LPC_SC->SCS |= 0x08;
	}

	//Setting for timeout problem
	LPC_MCI->DATATMR = 0x1FFFFFFF;

	/*set up clocking default mode, clear any registers as needed */
	LPC_MCI->COMMAND = 0;
	LPC_MCI->DATACTRL = 0;
	LPC_MCI->CLEAR = 0x7FF;		/* clear all pending interrupts */

	LPC_MCI->POWER = 0x02;		/* power up */
	while ( !(LPC_MCI->POWER & 0x02) );

	for ( i = 0; i < 0x100; i++ );

	/* During identification phase, the clock should be less than
	400Khz. Once we pass this phase, the normal clock can be set up
	to 25Mhz on SD card and 20Mhz on MMC card. */
	MCI_Set_MCIClock(MCI_SLOW_RATE );

	LPC_MCI->POWER |= 0x01;		/* bit 1 is set already, from power up to power on */

	for ( i = 0; i < 0x2000; i++ );

	NVIC_EnableIRQ(MCI_IRQn);

	MCI_CardInit();

	/* During the initialization phase, to simplify the process, the CMD related
	interrupts are disabled. The DATA related interrupts are enabled when
	the FIFOs are used and just before WRITE_BLOCK READ_BLOCK cmds are issues, and
	disabled after the data block has been written and read. Please also note,
	before WRITE_BLOCK only TX related data interrupts are enabled, and before
	READ_BLOCK only RX related data interrupts are enabled. */
	return MCI_FUNC_OK;
}


/************************************************************************//**
 * @brief 		Set output in open drain mode or pushpull mode
 *
 * @param[in]	mode the mode going to set
 *
 * @return 		None
 ***************************************************************************/
void MCI_SetOutputMode(uint32_t mode)
{
	if(mode == MCI_OUTPUT_MODE_OPENDRAIN)
	{
		/* Set Open Drain output control for MMC */
		LPC_MCI->POWER |= (1 << MCI_PWRCTRL_OPENDRAIN_POS) & MCI_PWRCTRL_BMASK;
	}
	else
	{
		/* Clear Open Drain output control for SD */
		LPC_MCI->POWER &= (~(1 << MCI_PWRCTRL_OPENDRAIN_POS) & MCI_PWRCTRL_BMASK);
	}
}


/************************************************************************//**
 * @brief 		The routine is used to send a CMD to the card
 *
 * @param[in]	CmdIndex the command to be sent to cards
 *
 * @param[in]	Argument the argument follows the command
 *
 * @param[in]	ExpectResp the response type for the command. They may be:
 *				- EXPECT_NO_RESP: means no response required
 *				- EXPECT_SHORT_RESP: means a response in a word needed
 *				- EXPECT_LONG_RESP: means a response in 4 words needed
 *
 * @param[in]	AllowTimeout allow timeout the command or not
 *
 * @return 		None
 ***************************************************************************/
void MCI_SendCmd(uint32_t CmdIndex, uint32_t Argument, uint32_t ExpectResp, uint32_t AllowTimeout)
{
	uint32_t i, CmdData = 0;
	uint32_t CmdStatus;

	/* the command engine must be disabled when we modify the argument
	or the peripheral resends */
	while ( (CmdStatus = LPC_MCI->STATUS) & MCI_CMD_ACTIVE )	/* Command in progress. */
	{
		LPC_MCI->COMMAND = 0;
		LPC_MCI->CLEAR = CmdStatus | MCI_CMD_ACTIVE;
	}

	for ( i = 0; i < 0x100; i++ );

	/*set the command details, the CmdIndex should 0 through 0x3F only */
	CmdData |= (CmdIndex & 0x3F);	/* bit 0 through 5 only */

	if ( ExpectResp == EXPECT_NO_RESP )			/* no response */
	{
		CmdData &= ~((1 << 6) | (1 << 7));		/* Clear long response bit as well */
	}
	else if ( ExpectResp == EXPECT_SHORT_RESP )	/* expect short response */
	{
		CmdData |= (1 << 6);
	}
	else if ( ExpectResp == EXPECT_LONG_RESP )	/* expect long response */
	{
		CmdData |= (1 << 6) | (1 << 7);
	}

	if ( AllowTimeout == ALLOW_CMD_TIMER )			/* allow timeout or not */
	{
		CmdData &= ~ MCI_DISABLE_CMD_TIMER;
	}
	else
	{
		CmdData |= MCI_DISABLE_CMD_TIMER;
	}

	/*send the command*/
	CmdData |= (1 << 10);		/* This bit needs to be set last. */

	LPC_MCI->ARGUMENT = Argument;	/* Set the argument first, finally command */

	LPC_MCI->COMMAND = CmdData;

	return;
}


/************************************************************************//**
 * @brief 		The routine is to get the reponse from card after commands.
 *				This function is always used in pair of MCI_SendCmd() func
 *
 * @param[in]	ExpectCmdData specify the command of which the data will be
 *				retrieved. This field should be the same with CmdIndex of
 *				MCI_SendCmd() function.
 *
 * @param[in]	ExpectResp the response type for the command. They may be:
 *				- EXPECT_NO_RESP: means no response required
 *				- EXPECT_SHORT_RESP: means a response in a word needed
 *				- EXPECT_LONG_RESP: means a response in 4 words needed
 *
 * @param[out]	CmdResp the buffer stored the data replied from cards
 *
 * @return 		MCI_FUNC_OK in case of success
 ***************************************************************************/
int32_t MCI_GetCmdResp(uint32_t ExpectCmdData, uint32_t ExpectResp, uint32_t *CmdResp)
{
	uint32_t CmdRespStatus = 0;
	uint32_t LastCmdIndex;

	if ( ExpectResp == EXPECT_NO_RESP )
	{
		return MCI_FUNC_OK;
	}

	while (1)
	{
		// Get the status of the component
		CmdRespStatus = LPC_MCI->STATUS;

