openxc/vi-firmware/src/libs/CDL/LPC177x_8xLib/src/lpc177x_8x_mci.c
		retryCount--;
	}

	return retval;
}


/************************************************************************//**
 * @brief 		Send CMD55 (APP_CMD) to indicate to the card that the next
 *				command is an application specific command rather than a 
 *				standard command. Before an ACMD, call this routine first
 *
 * @param		None
 *
 * @return 		MCI_FUNC_OK if all success
 ****************************************************************************/
int32_t MCI_Cmd_SendACMD( void )
{
	uint32_t i, retryCount;
	uint32_t CmdArgument;
	uint32_t respStatus;
	uint32_t respValue[4];

	int32_t retval = MCI_FUNC_FAILED;

	if ((MCI_CardType == MCI_SDSC_V1_CARD) ||
		(MCI_CardType == MCI_SDSC_V2_CARD) ||
		(MCI_CardType == MCI_SDHC_SDXC_CARD)) 
	{
		CmdArgument = CardRCA;	/* Use the address from SET_RELATIVE_ADDR cmd */
	}
	else			/* if MMC or unknown card type, use 0x0. */
	{
		CmdArgument = 0x00000000;
	}

	retryCount = 20;

	while ( retryCount > 0 )
	{
		respStatus = MCI_CmdResp(CMD55_APP_CMD, CmdArgument, EXPECT_SHORT_RESP, (uint32_t *)&respValue[0], ALLOW_CMD_TIMER);

		if(respStatus != 0)
		{
			retval = MCI_FUNC_FAILED;
		}
		else if (respValue[0] & CARD_STATUS_ACMD_ENABLE)
		{
			retval = MCI_FUNC_OK;
			break;
		}
		else
		{
			retval = MCI_FUNC_NOT_READY;
		}

		for ( i = 0; i < 0x20; i++ );

		retryCount--;
	}

	return retval;
}


/************************************************************************//**
 * @brief 		Send ACMD41 (SEND_APP_OP_COND) to Host Capacity Support (HCS)
 *				information and asks the accessed card to send its operating
 *				condition (OCR).
 *
 * @param[in]	hcsVal input the Host Capacity Support
 *
 * @return 		MCI_FUNC_OK if all success
 *
 * @note		If SEND_APP_OP_COND is timeout, the card in the slot is not MMC
 *				type, try this combination to see if we can communicate with
 *				a SD type.
 ****************************************************************************/
int32_t MCI_Acmd_SendOpCond(uint8_t hcsVal)
{
	uint32_t i, retryCount;
	uint32_t respStatus, argument;
	uint32_t respValue[4];

	int32_t retval = MCI_FUNC_FAILED;

	argument = OCR_INDEX | (hcsVal << MCI_ACMD41_HCS_POS);

	/* timeout on SEND_OP_COND command on MMC, now, try SEND_APP_OP_COND
	command to SD */
	retryCount = 0x200;			/* reset retry counter */

	while ( retryCount > 0 )
	{
		/* Clear Open Drain output control for SD */
		MCI_SetOutputMode(MCI_OUTPUT_MODE_PUSHPULL);

		for ( i = 0; i < 0x3000; i++ );

		if ((retval = MCI_Cmd_SendACMD()) == MCI_FUNC_OK)
		{
			respStatus = MCI_CmdResp(ACMD41_SEND_APP_OP_COND, argument, EXPECT_SHORT_RESP, (uint32_t *)&respValue[0], ALLOW_CMD_TIMER);

			if(respStatus & MCI_CMD_TIMEOUT)
			{
				retval = MCI_FUNC_TIMEOUT;
			}
			else if (!(respValue[0] & 0x80000000))
			{
				retval = MCI_FUNC_BUS_NOT_IDLE;
			}
			else
			{
				CCS = (respValue[0]&(1<<30)) ? 1:0;
				retval = MCI_FUNC_OK;
				break;
			}
		}

		for ( i = 0; i < 0x20; i++ );

		retryCount--;
	}

	return retval;
}

/************************************************************************//**
 * @brief 		Do initialization for the card in the slot
 *
 * @details		Try CMD1 first for MMC, if it's timeout, try CMD55
 *				and CMD41 for SD, if both failed, initialization faliure,
 *				bailout with unknown card type. Otherwise, return the
 *				card type, either MMC or SD. <<<KHOA_110708: checking>>>
 *
 *				This is followed Figure 4-2: Card Initialization and
 *				Identification Flow (SD mode) in Physical Layer Simplified
 *				Specification Version 2.00 document		
 *
 * @param		None
 *
 * @return 		MCI_FUNC_OK if success
 ****************************************************************************/
int32_t MCI_CardInit( void )
{
	uint32_t i;
	int32_t retval = MCI_FUNC_FAILED;

	MCI_CardType = MCI_CARD_UNKNOWN;

	if (MCI_CardReset() != MCI_FUNC_OK)
	{
		return MCI_FUNC_FAILED;
	}

	/* Clear Open Drain output control for SD */
	MCI_SetOutputMode(MCI_OUTPUT_MODE_PUSHPULL);

	for ( i = 0; i < 0x3000; i++ );

	retval = MCI_Cmd_SendIfCond();

	if(retval == MCI_FUNC_BAD_PARAMETERS)
	{
		//Unknow card is unusable
		return retval;
	}

	if(retval == MCI_FUNC_OK) /* Ver2.00 or later*/
	{
		//Check in case of High Capacity Supporting Host
		if ((retval = MCI_Acmd_SendOpCond(1)) == MCI_FUNC_OK)
		{
            MCI_CardType = MCI_SDSC_V2_CARD;//SDSC
            
            if(CCS )
            {
    			MCI_CardType = MCI_SDHC_SDXC_CARD;//SDHC or SDXC 
            }

			return MCI_FUNC_OK;	/* Found the card, it's a hD */
		}
	}

	if(retval != MCI_FUNC_OK) /* voltage mismatch (ver2.00)or ver1.X SD Card or not SD Card*/
	{
		
		//Check in case of Standard Capacity Supporting Host
		if ((retval = MCI_Acmd_SendOpCond(0)) == MCI_FUNC_OK)
		{
			MCI_CardType = MCI_SDSC_V1_CARD;//Support Standard Capacity only

			return MCI_FUNC_OK;	/* Found the card, it's a SD */
		}
	}

	if(retval != MCI_FUNC_OK)
	{
		/* Set Open Drain output control for MMC */
		MCI_SetOutputMode(MCI_OUTPUT_MODE_OPENDRAIN);

		for ( i = 0; i < 0x3000; i++ );

		/* Try CMD1 first for MMC, if it's timeout, try CMD55 and CMD41 for SD,
		if both failed, initialization faIlure, bailout. */
		if (MCI_Cmd_SendOpCond() == MCI_FUNC_OK)
		{
			MCI_CardType = MCI_MMC_CARD;

			return MCI_FUNC_OK;	/* Found the card, it's a MMC */
		}
	}

	/* tried both MMC and SD card, give up */
	return MCI_FUNC_OK;
}


/************************************************************************//**
 * @brief 		Get the type of card that is currently used in the slot
 *
 * @param		None
 *
 * @return 		Card Type: MMC Card or SD card
 ****************************************************************************/
en_Mci_CardType MCI_GetCardType(void)
{
	return MCI_CardType;
}


/************************************************************************//**
 * @brief 		Get the all the Identifier (CID) of the card by sending the 
 *				CMD2 (ALL_SEND_CID) command. Then parse 4-byte data obtained
 *				from the card by the CID meaning.	
 *
 * @param[out]	cidValue the CID Result after parsing the data from the card
 *
 * @return 		MCI_FUNC_OK if all success
 ****************************************************************************/
int32_t MCI_GetCID(st_Mci_CardId* cidValue)
{
	uint32_t i, retryCount;
	uint32_t respStatus;
	uint32_t respValue[4];

	/* This command is normally after CMD1(MMC) or ACMD41(SD). */
	retryCount = 0x200;// 0x20;			/* reset retry counter */

