openxc/vi-firmware/src/libs/CDL/LPC177x_8xLib/src/lpc177x_8x_mci.c
	dataSrcBlock = memblock;

	LPC_MCI->CLEAR = 0x7FF;

	LPC_MCI->DATACTRL = 0;

	for ( i = 0; i < 0x10; i++ );

	/* Below status check is redundant, but ensure card is in TRANS state
	before writing and reading to from the card. */
	if (MCI_CheckStatus() != MCI_FUNC_OK)
	{
		MCI_Cmd_StopTransmission();

		return(MCI_FUNC_FAILED);
	}

	LPC_MCI->DATATMR = DATA_TIMER_VALUE;

	LPC_MCI->DATALEN = BLOCK_LENGTH*numOfBlock;

	Mci_Data_Xfer_End = 1;
    Mci_Data_Xfer_ERR = 0;
    fifo_plane = 0;

	txBlockCnt = 0;

	MCI_TXEnable();

	if (MCI_Cmd_WriteBlock(blockNum, numOfBlock) != MCI_FUNC_OK)
	{
		return ( MCI_FUNC_FAILED );
	}

	//for(blockCnt = 0; blockCnt < numOfBlock; blockCnt++)
	{
#if MCI_DMA_ENABLED
		MCI_SettingDma((uint8_t*) dataSrcBlock, MCI_DMA_WRITE_CHANNEL, GPDMA_TRANSFERTYPE_M2P_DEST_CTRL);
		
		/* Write, block transfer, DMA, and data length */
		DataCtrl |= MCI_DATACTRL_ENABLE | MCI_DATACTRL_DIR_TO_CARD 
						| MCI_DATACTRL_DMA_ENABLE | MCI_DTATCTRL_BLOCKSIZE(DATA_BLOCK_LEN);
#else
		/* Write, block transfer, and data length */
		DataCtrl |= MCI_DATACTRL_ENABLE  | MCI_DATACTRL_DIR_TO_CARD  | MCI_DTATCTRL_BLOCKSIZE(DATA_BLOCK_LEN);
#endif
	}

	LPC_MCI->DATACTRL = DataCtrl;

	for ( i = 0; i < 0x10; i++ );

	return MCI_FUNC_OK;
}


/************************************************************************//**
 * @brief 		Read data at a specific address to starting block with number
 *				of blocks will be read from first block
 *
 * @details		
 *				- At preparation
 *					- Set MCI data control register, data length and data timeout
 *					- Send CMD17 (READ_SINGLE_BLOCK) or CMD18 (READ_MULTIPLE_BLOCK)
 *					commands to card
 *					- Enable interupt for MCI component
 *				- At completion
 *					- RX_ACTIVE interrupt is occured
 *					- Read data from FIFO register continuously until the data block
 *					length is reached to retrieve needed data
 *
 * @param[in]	*destBlock The pointer to location will captured data read
 *				from card
 *
 * @param[in]	blockNum The block number to start reading
 *
 * @param[in]	numOfBlock Determine how many blocks will be read (from the
 *				starting block)
 *
 * @return 		MCI_FUNC_OK if all success
 ****************************************************************************/
int32_t MCI_ReadBlock(uint8_t* destBlock, uint32_t blockNum, uint32_t numOfBlock)
{
	uint32_t i;
	uint32_t DataCtrl = 0;

	dataDestBlock = destBlock;

	LPC_MCI->CLEAR = 0x7FF;

	LPC_MCI->DATACTRL = 0;

	for ( i = 0; i < 0x10; i++ );

	/* Below status check is redundant, but ensure card is in TRANS state
	before writing and reading to from the card. */
	if ( MCI_CheckStatus() != MCI_FUNC_OK )
	{
		MCI_Cmd_StopTransmission();

		return(MCI_FUNC_FAILED);
	}

	MCI_RXEnable();

	LPC_MCI->DATATMR = DATA_TIMER_VALUE;

	LPC_MCI->DATALEN = BLOCK_LENGTH*numOfBlock;

	Mci_Data_Xfer_End = 1;
    Mci_Data_Xfer_ERR = 0;
	rxBlockCnt = 0;
    fifo_plane = 0;

	if ( MCI_Cmd_ReadBlock(blockNum, numOfBlock) != MCI_FUNC_OK )
	{
		return MCI_FUNC_FAILED;
	}

	//for(blockCnt = 0; blockCnt < numOfBlock; blockCnt++)
	{		
#if MCI_DMA_ENABLED
		MCI_SettingDma((uint8_t*) dataDestBlock, MCI_DMA_READ_CHANNEL, GPDMA_TRANSFERTYPE_P2M_SRC_CTRL);

		/* Write, block transfer, DMA, and data length */
		DataCtrl |= MCI_DATACTRL_ENABLE | MCI_DATACTRL_DIR_FROM_CARD
						| MCI_DATACTRL_DMA_ENABLE | MCI_DTATCTRL_BLOCKSIZE(DATA_BLOCK_LEN);
#else
		//Retrieving the result after reading the card is done by the FIFO handling for interrupt
		
		/* Read, enable, block transfer, and data length */
		DataCtrl |= MCI_DATACTRL_ENABLE | MCI_DATACTRL_DIR_FROM_CARD | MCI_DTATCTRL_BLOCKSIZE(DATA_BLOCK_LEN);

#endif
	}
	
	LPC_MCI->DATACTRL = DataCtrl;

	for ( i = 0; i < 0x10; i++ );

	return MCI_FUNC_OK;
}


/************************************************************************//**
 * @brief 		Turn off the MCI power by disabling the Power Register for MCI
 *
 * @param		None
 *
 * @return 		None
 ****************************************************************************/
void MCI_PowerOff(void) 
{
	uint32_t i;

	LPC_MCI->POWER = 0;
	
	for (i = 0; i < 0x100; i++);
	
	return;
}


/**
 * @}
 */

#endif /*_MCI*/

/*****************************************************************************
**                            End Of File
******************************************************************************/
